src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ПрефиксВетки</name>
    <type>
      <types>CatalogRef.ПрефиксыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДорабатыватьКонфигурацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаBitrix</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаGit</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Стадия</name>
    <type>
      <types>CatalogRef.СтадииКанбан</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадачи</name>
    <type>
      <types>EnumRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрок</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>CatalogRef.Спринты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиБазовой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>CatalogRef.Задачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПланировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьКрайнийСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБазовойЗадачи</name>
    <type>
      <types>EnumRef.ТипыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияБазовойЗадачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиИтилиум</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаРелиза</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаMergeRequest</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеФайлы</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.ОбъектыРазработки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КасаемыеПроцессы</name>
    <attributes>
      <name>Процесс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяПроцесса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>ИДКомментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спринты</name>
    <attributes>
      <name>Спринт</name>
      <type>
        <types>CatalogRef.Спринты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпринтРазработки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФактическиеТрудозатраты</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗатраченноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗадачи</name>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыОбъектовРазработки/ТипыОбъектовРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовРазработки</name>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
  <enumValues>
    <name>Расширение</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ОбъектыРазработки/ОбъектыРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыРазработки</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ТипОбъектаРазработки</name>
    <type>
      <types>EnumRef.ТипыОбъектовРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияВерсий</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВерсии</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПользователей</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>ТокенGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРепозиторияНаШаре</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаПользователяGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТимЛид</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПользователяGitLab</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDПользователяBitrix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автотрудозатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Задачи/Forms/ФормаЭлемента/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьФорму(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьСсылкуSonar();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИзBitrix(Команда)
	ОбновитьИзBitrixНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодборОбработок(Команда)
	
	ТипыОбъектовРазработки = Новый Массив;
	ТипыОбъектовРазработки.Добавить(ПредопределенноеЗначение("Перечисление.ТипыОбъектовРазработки.Обработка"));
	ТипыОбъектовРазработки.Добавить(ПредопределенноеЗначение("Перечисление.ТипыОбъектовРазработки.Отчет"));
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", Объект.Владелец);
	ПараметрыОтбора.Вставить("ТипОбъектаРазработки", ТипыОбъектовРазработки);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииПодборОбработок", ЭтотОбъект, "Подбор");
	ОткрытьФорму("Справочник.ОбъектыРазработки.ФормаВыбора", ПараметрыФормы, ЭтотОбъект, , , , ОбработкаВыбора);

КонецПроцедуры

&НаКлиенте
Процедура СсылкаBitrixНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Объект.СсылкаBitrix);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаSonarНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(СсылкаSonar);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПроцессы(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПроцессыПослеВыбора", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Проект", Объект.Владелец);
	
	ОткрытьФорму("Обработка.КомандыПроцессов.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьПроцессыПослеВыбора(СписокВыбранныхПроцессов, Параметры) Экспорт

	Если СписокВыбранныхПроцессов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.КасаемыеПроцессы.Очистить();
	
	Для Каждого ВыбранныйПроцесс Из СписокВыбранныхПроцессов Цикл
		СтрокаТаблицы = Объект.КасаемыеПроцессы.Добавить();
		СтрокаТаблицы.Процесс = ВыбранныйПроцесс.Представление;
		СтрокаТаблицы.ПолноеИмяПроцесса = ВыбранныйПроцесс.Значение;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзBitrixНаСервере()
	
	НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
	Если НастройкиПользователя = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнены настройки пользователя!'"));
		Возврат;
	КонецЕсли;
	ЗадачаОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеЗаполнения = РаботаСПредприятие1С.СтруктурированныеДанныеПоЗадаче(ЗадачаОбъект.НомерЗадачи);
	Если ЗадачаОбъект.ПрефиксВетки = Справочники.ПрефиксыЗадач.hotfix Тогда
		ЗадачаОбъект.ПоменятьСтатусыЗадачи(ДанныеЗаполнения);
	Иначе
		ЗадачаОбъект.Заполнить(ДанныеЗаполнения);
	КонецЕсли;
	//ЗадачаОбъект.ПолучитьСписокТрудозатратЗадачи();
	//ЗадачаОбъект.ЗаполнитьСвязанныеЗадачи();
	ЗначениеВРеквизитФормы(ЗадачаОбъект, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииПодборОбработок(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Значение Цикл
		НайденныеСтроки = Объект.ВнешниеФайлы.НайтиСтроки(Новый Структура("Обработка", Элемент));
		Если Не НайденныеСтроки.Количество() Тогда
			НоваяСтрока = Объект.ВнешниеФайлы.Добавить();
			НоваяСтрока.Обработка = Элемент;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НоваяОбработкаНаСервере(ИмяОбработки, БазаРепозитория)
	
	Если Не ЗначениеЗаполнено(БазаРепозитория) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось определить базу для получения каталога репозитория базы!'"));
		Возврат;
	КонецЕсли;
	КаталогРепозиторияБазы = РаботаСGit.КаталогРепозиторияБазыШара(БазаРепозитория);
	Если ПустаяСтрока(КаталогРепозиторияБазы) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указан каталог репозитория базы!'"));
		Возврат;
	КонецЕсли;
	//todo вынести в менеджер или модуль
	ПутьКШаблону = СтрШаблон("%1\Шаблоны\ШаблонОбработки.epf", КаталогРепозиторияБазы);
	ПутьКНовойОбработке =  СтрШаблон("%1\build\epf\%2.epf", КаталогРепозиторияБазы, ИмяОбработки);
	КопироватьФайл(ПутьКШаблону, ПутьКНовойОбработке);
	
	ОбработкаОбъект = Справочники.ОбъектыРазработки.СоздатьЭлемент();
	ОбработкаОбъект.УстановитьНовыйКод();
	ОбработкаОбъект.Владелец = Объект.Владелец;
	ОбработкаОбъект.Наименование = ИмяОбработки;
	ОбработкаОбъект.ТипОбъектаРазработки = Перечисления.ТипыОбъектовРазработки.Обработка;
	ОбработкаОбъект.Версия = Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMdd");
	ОбработкаОбъект.Записать();

	Обработка = ОбработкаОбъект.Ссылка;
	
	СтрокаВнешнихФайлов = Объект.ВнешниеФайлы.Добавить();
	СтрокаВнешнихФайлов.Обработка = Обработка;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура НоваяОбработка(Команда)
	
	НазваниеОбработки = "";
	
	Обещание = ВвестиСтрокуАсинх(НазваниеОбработки, НСтр("ru = 'Введите название обработки'"));
	ИмяОбработки = Ждать Обещание;
	Если ЗначениеЗаполнено(ИмяОбработки) Тогда
		НоваяОбработкаНаСервере(ИмяОбработки, ВладелецФормы.База);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработки(Команда)
	
	//todo Открывать шару
	ПутьКНовойОбработке = СтрШаблон("%1\build\epf", НастройкиПользователя.КаталогРепозиторияНаШаре);
	ЗапуститьПриложение(ПутьКНовойОбработке);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		НастройкиПользователя = Справочники.НастройкиПользователей.НастройкиТекущегоПользователя();
		Если НастройкиПользователя = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнены настройки пользователя!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСсылкуSonar()
	ШаблонСсылкиSonar = ШаблонСсылкиSonar();
	СсылкаSonar = СтрШаблон(ШаблонСсылкиSonar, Объект.ИмяВетки, Нрег(Объект.Владелец)); 	
КонецПроцедуры

&НаСервере
Функция ШаблонСсылкиSonar()
	Возврат "http://gitlabprojects.toolsworld.root.local:9000/dashboard?branch=feature/%1&id=%2";
КонецФункции

&НаКлиенте
Процедура ИзменитьСостояние(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатус(Команда)

	ИзменитьСтатусНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусНаСервере()


КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьКомментарий(Команда)

	КомментарийКЗадаче = "";
	
	Обещание = ВвестиСтрокуАсинх(КомментарийКЗадаче, НСтр("ru = 'Введите комментарий'"),, Истина);
	КомментарийКЗадаче = Ждать Обещание;
	Если Не ЗначениеЗаполнено(КомментарийКЗадаче) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Комментарий не введен'"));
		Возврат;
	КонецЕсли;
	НастройкиПользователя = ТекущиеНастройкиПользователя();
	
	ДобавитьКомментарийНаСервере(Объект.Ссылка, КомментарийКЗадаче, НастройкиПользователя.ТокенBitrix);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущиеНастройкиПользователя()
	
	ТекущийПользователь = Пользователи.АвторизованныйПользователь();
	Возврат Справочники.НастройкиПользователей.НастройкиТекущегоПользователя(ТекущийПользователь);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьКомментарийНаСервере(Задача, Комментарий, Токен)

	Справочники.Задачи.ДобавитьКомментарийКЗадаче(Задача, Комментарий, Токен);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаMergeRequestНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Объект.СсылкаMergeRequest);

КонецПроцедуры


#КонецОбласти
